<a href="https://colab.research.google.com/github/Nurjanah4079/python/blob/main/1_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

### Data Manipulation with Pandas
Seluruh project tentang memulai dengan Panda:
1. Creating DataFrames // mengimport data sebagai dataframe

2. Beberapa basic checks dan datatype
3. Indexing/sampling // pengambilan data
4. Conditional filtering // penyaringan bersyarat
5. Subsetting || Updating Row || Add/Remove
6. Sorting || Groupby || Aggregation // pengurutan || pengelompokan || pengumpulan

# Apa yang dimaksud Pandas?
Pandas adalah python library untuk Data Analysis dan Data Manipulation. Pandas membuat bekerja dengan data tabular sangat mudah.
Pandas memiliki dua data object utama:
1. Series = one-dimentional indexed array
2. DataFrame = two-dimentional indexed array; a tablle like stucture; can be though of parallally stacked Series; In dataframe every column is a pandas series. array berindeks dua dimensi; struktur seperti tabel; dapat meskipun Seri ditumpuk secara paralel; Dalam kerangka data, setiap kolom adalah seri panda.

## Creating Dataframe

1. Data Frame adalah struktur seperti tabel
2. Setiap kolom berisi pengukuran pada satu variabel.
3. Setiap baris berisi satu kasus atau satu pengamatan untuk setiap kolom.

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
PATH = "/content/drive/MyDrive/python/dataset/Python_Session2_Datasets"

In [3]:
import numpy as np  
import pandas as pd

In [9]:
# cretaing panda data frame from dictionary
data = {'name': ['Nur', 'Janah', 'Nje', 'Anna'], 
        'age': [7, 7, 8, 5],
        'Profesi': ['student', 'student','student','student']}
df = pd.DataFrame(data)
df

    name  age  Profesi
0    Nur    7  student
1  Janah    7  student
2    Nje    8  student
3   Anna    5  student